{
	"intents": [
		{
			"tag": "IBS_definition",
			"patterns": [
				"What is IBS?",
				"Can you explain IBS?",
				"What does IBS stand for?",
				"What is irritable bowel syndrome?"
			],
			"responses": [
				"IBS stands for Irritable Bowel Syndrome. It's a common disorder affecting the digestive system.",
				"IBS is a long-term condition that causes recurring discomfort in the stomach and intestines.",
				"IBS, or irritable bowel syndrome, causes symptoms like stomach pain, bloating, diarrhea, and constipation."
			]
		},
		{
			"tag": "IBS_symptoms",
			"patterns": [
				"What are the symptoms of IBS?",
				"How do I know if I have IBS?",
				"Can you list symptoms of irritable bowel syndrome?",
				"What are common signs of IBS?"
			],
			"responses": [
				"Common symptoms of IBS include abdominal pain, bloating, gas, diarrhea, and constipation.",
				"Symptoms of IBS can vary but often include stomach cramps, bloating, and changes in bowel movements.",
				"The main symptoms of IBS are abdominal discomfort, bloating, and irregular bowel habits, either diarrhea or constipation."
			]
		},
		{
			"tag": "IBS_treatment",
			"patterns": [
				"How is IBS treated?",
				"What can I do to relieve IBS symptoms?",
				"What treatments are available for IBS?",
				"Can IBS be cured?"
			],
			"responses": [
				"While there's no cure for IBS, treatments like dietary changes, stress management, and medications can help manage symptoms.",
				"Treatment for IBS often involves lifestyle changes, medications, and sometimes counseling to manage stress.",
				"Managing IBS symptoms may include increasing fiber intake, avoiding trigger foods, and staying hydrated."
			]
		},
		{
			"tag": "IBS_diet",
			"patterns": [
				"What foods should I avoid with IBS?",
				"What is the best diet for IBS?",
				"Can diet affect IBS?",
				"What foods trigger IBS symptoms?"
			],
			"responses": [
				"Certain foods can trigger IBS symptoms, like fatty foods, dairy, alcohol, and caffeine. A low-FODMAP diet may help.",
				"Foods that often trigger IBS symptoms include high-fat foods, dairy, alcohol, and foods high in fiber. Consider talking to a dietitian about a low-FODMAP diet.",
				"Managing IBS through diet can involve avoiding trigger foods like caffeine, dairy, and certain carbohydrates."
			]
		},
		{
			"tag": "IBS_cause",
			"patterns": [
				"What causes IBS?",
				"Why do people get IBS?",
				"What are the reasons for IBS?",
				"What leads to irritable bowel syndrome?"
			],
			"responses": [
				"The exact cause of IBS is not known, but factors include stress, certain foods, and changes in gut bacteria.",
				"IBS may be caused by a combination of abnormal gut contractions, sensitivity to certain foods, stress, or an infection.",
				"While the cause of IBS isn't fully understood, it often involves gut-brain communication problems, stress, or bacterial imbalances."
			]
		},
		{
			"tag": "IBS_diagnosis",
			"patterns": [
				"How is IBS diagnosed?",
				"What tests are done to diagnose IBS?",
				"Can a doctor diagnose IBS?",
				"How do I find out if I have IBS?"
			],
			"responses": [
				"IBS is usually diagnosed based on symptoms and medical history, but doctors may also run tests to rule out other conditions.",
				"There is no single test for IBS. Doctors often diagnose it by ruling out other conditions and using criteria like the Rome IV guidelines.",
				"A diagnosis of IBS is often made based on symptoms such as recurrent abdominal pain and changes in bowel habits."
			]
		}
	]
}
